In [51]:
# task 1

import pandas as pd

data = {
    "Age": [25, 30, 35, 40, 45],
    "Name": ["Alice", "Bob", "Carol", "David", "Eve"],
    "Salary": [5000, 5500, 6000, 6500, 7000]
}

df = pd.DataFrame(data=data)
df

   Age   Name  Salary
0   25  Alice    5000
1   30    Bob    5500
2   35  Carol    6000
3   40  David    6500
4   45    Eve    7000

In [52]:
df.loc[(df.Name=='Alice') | (df.Name=='Carol')]

   Age   Name  Salary
0   25  Alice    5000
2   35  Carol    6000

In [53]:
df.set_index('Name', inplace=True)

In [54]:
df

       Age  Salary
Name
Alice   25    5000
Bob     30    5500
Carol   35    6000
David   40    6500
Eve     45    7000

In [61]:
df.loc[["Alice", "Carol"]]

       Age  Salary
Name
Alice   25    5000
Carol   35    6000

In [88]:
df.loc[["Alice", "Carol"], ["Salary", "Age"]].loc[df.Salary>5000]

       Salary  Age
Name
Carol    6000   35

In [90]:
# task 2

import pandas as pd

data = {
    "Age": [25, 30, 35, 40, 45],
    "Name": ["Alice", "Bob", "Carol", "David", "Eve"],
    "Salary": [5000, 5500, 6000, 6500, 7000]
}

df = pd.DataFrame(data=data)
df.set_index('Name', inplace=True)
df

       Age  Salary
Name
Alice   25    5000
Bob     30    5500
Carol   35    6000
David   40    6500
Eve     45    7000

In [93]:
df.iloc[[0, 2]]

       Age  Salary
Name
Alice   25    5000
Carol   35    6000

In [94]:
# task 3

import pandas as pd

data = {
    "Age": [25, 30, 35, 40, 45],
    "Name": ["Alice", "Bob", "Carol", "David", "Eve"],
    "Salary": [5000, 5500, 6000, 6500, 7000]
}

df = pd.DataFrame(data=data)
df.set_index('Name', inplace=True)
df

       Age  Salary
Name
Alice   25    5000
Bob     30    5500
Carol   35    6000
David   40    6500
Eve     45    7000

In [102]:
df.loc[['Bob', "Eve"], "Age"]

Name
Bob    30
Eve    45
Name: Age, dtype: int64

In [103]:
type(df.loc[['Bob', "Eve"], "Age"])

pandas.core.series.Series

In [104]:
df.loc[['Bob', "Eve"], :"Age"]

      Age
Name
Bob    30
Eve    45

In [105]:
type(df.loc[['Bob', "Eve"], :"Age"])

pandas.core.frame.DataFrame

In [106]:
# task 4

import pandas as pd

data = {
    "Age": [25, 30, 35, 40, 45],
    "Name": ["Alice", "Bob", "Carol", "David", "Eve"],
    "Salary": [5000, 5500, 6000, 6500, 7000]
}

df = pd.DataFrame(data=data)
df.set_index('Name', inplace=True)
df

       Age  Salary
Name
Alice   25    5000
Bob     30    5500
Carol   35    6000
David   40    6500
Eve     45    7000

In [124]:
df.iloc[1,0]

30

In [119]:
df.iloc[1]["Age"]

30

In [120]:
df.iloc[1].loc["Age"]

30

In [121]:
df.loc['Bob', "Age"]

30

In [150]:
# task 5

import pandas as pd

data = {
    "Age": [25, 30, 35, 40, 45],
    "Name": ["Alice", "Bob", "Carol", "David", "Eve"],
    "Salary": [5000, 5500, 6000, 6500, 7000]
}

df = pd.DataFrame(data=data)
df.set_index('Name', inplace=True)
df

       Age  Salary
Name
Alice   25    5000
Bob     30    5500
Carol   35    6000
David   40    6500
Eve     45    7000

In [151]:
df.loc[df.Age > 30]

       Age  Salary
Name
Carol   35    6000
David   40    6500
Eve     45    7000

In [152]:
type(df.loc[df.Age > 30])

pandas.core.frame.DataFrame

In [153]:
df.loc[df['Age'] > 30]

       Age  Salary
Name
Carol   35    6000
David   40    6500
Eve     45    7000

In [154]:
type(df.loc[df['Age'] > 30])

pandas.core.frame.DataFrame

In [155]:
df[df[ "Age"] > 30]

       Age  Salary
Name
Carol   35    6000
David   40    6500
Eve     45    7000

In [156]:
type(df[df[ "Age"] > 30])

pandas.core.frame.DataFrame